# Terraform - development
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./src/shared/terraform/workspaces/development relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Connectilly/Connectilly/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Connectilly/Connectilly

To view this run in a browser, visit:
https://app.terraform.io/app/connectilly/development/runs/run-KRJxQxVp2A6LTeUt

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
data.tfe_organization.default: Refreshing...
data.tfe_organization.default: Refresh complete after 0s [id=org-5y3MEgeuSg9nz1bX]
data.tfe_workspace.default: Refreshing...
tfe_project.default: Refreshing state... [id=prj-e9fn5rNV2u9MNkZi]
module.identity.tfe_workspace.identity_api: Refreshing state... [id=ws-XrCuzs1Gt6AcUjJb]
module.organization.tfe_workspace.organization_api: Refreshing state... [id=ws-DwQuBwUTggRNZjH6]
module.organization.tfe_workspace.organization: Refreshing state... [id=ws-AVRzgDRdYbPmdwHx]
module.identity.tfe_workspace.identity: Refreshing state... [id=ws-Z3nNcuzGcdKekYAc]
module.customer.tfe_workspace.customer: Refreshing state... [id=ws-6BVJ14HzpfRniY3z]
module.customer.tfe_workspace.customer_api: Refreshing state... [id=ws-sr5mfYj3TiGThmie]
data.tfe_workspace.default: Refresh complete after 0s [id=ws-uEsVKbbQGjgi1RqK]
data.tfe_variables.default: Refreshing...
module.customer.tfe_variable.customer_api_aws_access_key_id: Refreshing state... [id=var-XdTfjQePYygDBDGV]
module.customer.tfe_variable.customer_api_cockroach_api_key: Refreshing state... [id=var-P8QR7N4Y857WS4mm]
module.customer.tfe_variable.customer_api_aws_secret_access_key: Refreshing state... [id=var-q5NWgJDv9EbBJDTy]
module.organization.tfe_variable.organization_api_aws_access_key_id: Refreshing state... [id=var-bDTJNPBTdpC4fyjm]
module.organization.tfe_variable.organization_api_aws_secret_access_key: Refreshing state... [id=var-spWHREycqRMf93LP]
module.organization.tfe_variable.organization_api_cockroach_api_key: Refreshing state... [id=var-xDEr5uAZERyhkxzg]
data.tfe_variables.default: Refresh complete after 0s [id=variables/ws-uEsVKbbQGjgi1RqK]
module.customer.tfe_variable.customer_aws_access_key_id: Refreshing state... [id=var-8vkRyMnX9BmKD4eW]
module.customer.tfe_variable.customer_aws_secret_access_key: Refreshing state... [id=var-yVM48J9BNxFeTj17]
module.customer.tfe_variable.customer_cockroach_api_key: Refreshing state... [id=var-QxTZEv5hFaxTKq8Q]
module.identity.tfe_variable.identity_aws_access_key_id: Refreshing state... [id=var-8g9tZrQqifZYdUuL]
module.identity.tfe_variable.identity_cockroach_api_key: Refreshing state... [id=var-HH8HuAkDnsUFDU3X]
module.identity.tfe_variable.identity_aws_secret_access_key: Refreshing state... [id=var-yk5rAqAv6xA7hVwf]
module.organization.tfe_variable.organization_aws_access_key_id: Refreshing state... [id=var-Dz47WGmD7iw7YBRy]
module.organization.tfe_variable.organization_cockroach_api_key: Refreshing state... [id=var-oSTvLKjC1sj5Apwk]
module.organization.tfe_variable.organization_aws_secret_access_key: Refreshing state... [id=var-nD459wyyT8MmcHjA]
module.identity.tfe_variable.identity_api_aws_access_key_id: Refreshing state... [id=var-kqDkefLD6w5rx2r9]
module.identity.tfe_variable.identity_api_aws_secret_access_key: Refreshing state... [id=var-iFsvffAPoTasEjGF]
module.identity.tfe_variable.identity_api_cockroach_api_key: Refreshing state... [id=var-LYekKdE928VixgDh]
module.customer.tfe_workspace.customer_api: Drift detected (update)
module.customer.tfe_workspace.customer: Drift detected (update)
module.identity.tfe_workspace.identity: Drift detected (update)
module.identity.tfe_workspace.identity_api: Drift detected (update)
module.organization.tfe_workspace.organization: Drift detected (update)
module.organization.tfe_workspace.organization_api: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.shared.tfe_variable.shared_aws_access_key_id will be created
  + resource "tfe_variable" "shared_aws_access_key_id" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY_ID"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.shared.tfe_variable.shared_aws_secret_access_key will be created
  + resource "tfe_variable" "shared_aws_secret_access_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.shared.tfe_variable.shared_cockroach_api_key will be created
  + resource "tfe_variable" "shared_cockroach_api_key" {
      + category     = "env"
      + hcl          = false
      + id           = (known after apply)
      + key          = "COCKROACH_API_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.shared.tfe_workspace.shared will be created
  + resource "tfe_workspace" "shared" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "remote"
      + file_triggers_enabled         = true
      + force_delete                  = false
      + global_remote_state           = (known after apply)
      + html_url                      = (known after apply)
      + id                            = (known after apply)
      + name                          = "development-shared"
      + operations                    = (known after apply)
      + organization                  = "connectilly"
      + project_id                    = "prj-e9fn5rNV2u9MNkZi"
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + resource_count                = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "development",
          + "shared",
        ]
      + terraform_version             = (known after apply)
      + working_directory             = "./src/shared/infrastructure/workspaces/development"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*